ronit991/TivaPeripheralDrivers/TM4C123xxSSI_DRIVER.c
/******************************************************************************************************************
*	@file			-	TM4C123xxSSI_DRIVER.c																																								*
*	@author		-	Ronit Vairagi																																												*
*																																																									*
*	This file contains definitions of SSI Driver APIs.																															*
*																																																									*
* @Note			-	All of the code present in the this file applies to TM4C123GH6PM microcontroller.										*
*																																																									*
*	@Note2		- Feel free to use, modify, and/or re-distribute this code at your will.															*
******************************************************************************************************************/

#include "TM4C123xxSSI_DRIVER.h"
#include <math.h>


__vo uint16_t* SSIIntrTxBuf[4] = {NULL,NULL,NULL,NULL};
__vo uint16_t* SSIIntrRxBuf[4] = {NULL,NULL,NULL,NULL};

__vo uint8_t SSIIntrTxCount[4] = {0,0,0,0};
__vo uint8_t SSIIntrRxCount[4] = {0,0,0,0};




/******************************************************************************************************************
*																				Pins Available for SSI functions																					*
*																																																									*
*		 SSIx				CLK				SS				Rx				Tx		Comments																											*
*																																																									*
*			0					PA2				PA3				PA4				PA5																																	*
*			1					PF2				PF3				PF0				PF1																																	*
*			1					PD0				PD1				PD2				PD3		(These pins aren't used for SSI1 in this driver)							*
*			2					PB4				PB5				PB6				PB7																																	*
*			3					PD0				PD1				PD2				PD3																																	*
******************************************************************************************************************/



/******************************************************************************************************************
*																					APIs Supported by this Driver																						*
*	Below are the prototypes for driver APIs																																				*
*	1. SSIClockControl()		-	Enable/Disable clock for an SSI Module.																								*
*	2. SSIInit()						-	Initialize and SSI Module.																														*
*	3. SSIDeInit()					-	Reset and turn off an SSI Module.																											*
*																																																									*
*	4. SPIStart()						-	Initialize an SSI Module for FREESCALE SPI format, with some default configurations.	*
*																																																									*
*	5. SSISendData()				-	Send data over an SSI Module.																													*
*	6. SSISend()						-	Send one packet(16-bit) of data over an SSI Module.																		*
*																																																									*
*	7.	SSIRecvData()				-	Receive data over an SSI Module.																											*
*	8.	SSIRecv()						-	Receive one packet(16-bit) of data over an SSI Module.																*
*																																																									*
*	9.	SSISendWithIntr()		-	Send Data without blocking the CPU by using interrupts.																*
*	10. SSIRecvWithIntr()		-	Receive Data without blocking the CPU by using interrupts.														*
*																																																									*
*	11. SSIIntrSend()				-	Helper for SSI Interrupt Handler function.																						*
*	12. SSIIntrRecv()				-	Helper for SSI Interrupt Handler function.																						*
*																																																									*
*	13. SSIGetAddress()			-	Get the access pointer for a given SSI Module.																				*
*	14.	WaitWhileSSIControllerIsBusy() - Pause program execution till the SSI controller is busy in transmission.		*
*		Definitions for these can be found in TM4C123xxSSI_DRIVER.c file																							*
******************************************************************************************************************/



/******************************************************************************************************************
*	@SSIClockControl()																																															*
* @brief			-	This function is used to enable or disable clock for a particular SSI module.											*
*	@SSIx				- Name of the SSI module for which clock needs to be enabled or disabled.														*
*	@EnOrDi			- This variable speifies whether we have to enable or disable the clock.														*
*								Use (I) ENABLE or (II) DISABLE macros for this variable.																					*
******************************************************************************************************************/
void SSIClockControl(uint8_t SSIx, uint8_t	EnOrDi)
{
	if(EnOrDi == ENABLE)
		switch(SSIx)
		{
			case SSI0:	SSI0_PCLK_EN();		break;		//	These macros are defined in section 3.2 in TM4C123xx.h file
			case SSI1:	SSI1_PCLK_EN();		break;
			case SSI2:	SSI2_PCLK_EN();		break;
			case SSI3:	SSI3_PCLK_EN();		break;
		}
	else
		switch(SSIx)
		{
			case SSI0: SSI0_PCLK_DIS();		break;		//	These macros are defined in section 3.2 in TM4C123xx.h file
			case SSI1: SSI1_PCLK_DIS();		break;
			case SSI2: SSI2_PCLK_DIS();		break;
			case SSI3: SSI3_PCLK_DIS();		break;
		}
}



/******************************************************************************************************************
*	@SSIInit()																																																			*
*	@brief						-	This function Initializes an SSI module.																										*
* @SSIx							-	This is the name of the SSI module which needs to be initialized.														*
*	@DeviceMode				-	Used to specify Master or Slave mode.																												*
* @ClockSource			-	Used to select the clock source for the SSI module.																					*
*	@ClockPrescalar		-	Even number by which the clock is divided i.e. prescaled.																		*
*	@SerialClkRate		-	SCR is used to configure the SSI clock frequency.																						*
*	@Phase						-	0 => Data capture on first clk edge,	1=> Data capture on second clk edge										*
*	@Polarity					-	0 => Steady Low SSI Clk,	1 => Steady High SSI Clk																					*
*											Phase and Polarity jointly determine the instant at which data is captured.									*
*	@FrameFormat			-	Format of data transfer (Freescale SPI, MICROWIRE, TI SSI Format).													*
*	@DataSize					-	Size of data frame in bits.																																	*
*																																																									*
*	@Note							-	See Pg No. 956 (Section 15.4) for detailed steps on Initialization and Configuration.				*
******************************************************************************************************************/
void SSIInit(uint8_t SSIx, uint8_t DeviceMode, uint8_t ClockSource, uint8_t ClockPrescalar, uint8_t SerialClkRate, uint8_t Phase, uint8_t Polarity, uint8_t FrameFormat, uint8_t DataSize)
{
	ssi_reg*	pSSI;								// Pointer to the SSI Module which needs to be initialized.
	GPIO_reg* pGPIO;							// Pointer to the GPIO port which has pins for the given SSI Module.
	uint8_t ssi_pins = 0x00;			// Variable to hold '1' for corresponding SSI pins on a GPIO port.
	
	SSIClockControl(SSIx, ENABLE);																//	Step 1 of Section 15.4: Enable Clock for the SSI Module.
	
	switch(SSIx)
	{
		case SSI0:	// Configure pins for SSI0 (Alternate Function # 2)
		
								pGPIO = GPIO_A_P;																//	GPIO_A has the pins for SSI0
								ssi_pins = 0x3C;																//	PA2,3,4,5 are used for SSI0
		
								GPIO_ClockControl(GPIO_PORT_A, ENABLE);					//	Step 2 of Section 15.4
								pGPIO->GPIO_AFSEL |= ssi_pins;									//	Step 3 of Section 15.4
								pGPIO->GPIO_PCTL &= 0xFF0000FF;									//	Step 4 of Section 15.4
								pGPIO->GPIO_PCTL |= 0x00222200;
		
								pSSI = pSSI0;							//	Pointer to SSI0
								break;
		
		//-------------------------------------------------------------------------------------------------------------
		case SSI1:	// Configure pins for SSI1 (Alternate Function # 2)
		
