ronit991/TivaPeripheralDrivers/TM4C123xxSSI_DRIVER.c
								pGPIO = GPIO_F_P;																//	GPIO_F has the pins for SSI1
								ssi_pins = 0x0F;																//	PF0,1,2,3 are used for SSI2
		
								GPIO_ClockControl(GPIO_PORT_F, ENABLE);					//	Step 2 of Section 15.4
								pGPIO->GPIO_AFSEL |= ssi_pins;									//	Step 3 of Section 15.4
								pGPIO->GPIO_PCTL &= 0xFFFF0000;									//	Step 4 of Section 15.4
								pGPIO->GPIO_PCTL |= 0x00002222;
		
								pSSI = pSSI1;							//	Pointer to SSI1
								break;
		
		//-------------------------------------------------------------------------------------------------------------
		case SSI2:	// Configure pins for SSI2 (Alternate Function # 2)
		
								pGPIO = GPIO_B_P;																//	GPIO_B has the pins for SSI2
								ssi_pins = 0xF0;																//	PB4,5,6,7 are used for SSI2
		
								GPIO_ClockControl(GPIO_PORT_B, ENABLE);					//	Step 2 of Section 15.4
								pGPIO->GPIO_AFSEL |= ssi_pins;									//	Step 3 of Section 15.4
								pGPIO->GPIO_PCTL &= 0x0000FFFF;									//	Step 4 of Section 15.4
								pGPIO->GPIO_PCTL |= 0x22220000;
		
								pSSI = pSSI2;							//	Pointer to SSI2
								break;
		
		//-------------------------------------------------------------------------------------------------------------
		case SSI3:	// Configure pins for SSI3 (Alternate Function # 1)
		
								pGPIO = GPIO_D_P;																//	GPIO_D has the pins for SSI3
								ssi_pins = 0x0F;																//	PD0,1,2,3 are used for SSI3
		
								GPIO_ClockControl(GPIO_PORT_D, ENABLE);					//	Step 2 of Section 15.4
								pGPIO->GPIO_AFSEL |= ssi_pins;									//	Step 3 of Section 15.4
								pGPIO->GPIO_PCTL &= 0xFFFF0000;									//	Step 4 of Section 15.4
								pGPIO->GPIO_PCTL |= 0x00001111;
		
								pSSI = pSSI3;							//	Pointer to SSI3
								break;
	}
	
	pGPIO->GPIO_DEN |= ssi_pins;																	//	Step 5... of Section 15.4
	pGPIO->GPIO_PUR |= ssi_pins;																	//	Step 5... of Section 15.4
	pGPIO->GPIO_DR8R |= ssi_pins;																	//	Step 5... of Section 15.4
	
	pSSI->SSI_CR[1] CLR_BIT( SSI_CR1_SSE );												//	Step ff.1 of Section 15.4
	
	switch(DeviceMode)																						//	Step ff.2 of Section 15.4
	{
		case SSI_Master_Mode:				pSSI->SSI_CR[1] = 0x00000000;				break;
		case SSI_Slave_Mode_OutEn:	pSSI->SSI_CR[1] = 0x00000004;				break;
		case SSI_Slave_Mode_OutDis:	pSSI->SSI_CR[1] = 0x0000000C;				break;
	}
	
	switch(ClockSource)																						//	Step ff.3 of Section 15.4
	{
		case SSI_Clk_SystemClock:		pSSI->SSI_CC &= 0xFFFFFFF0;		break;		//	System Clock
		case SSI_Clk_PIOSC:					pSSI->SSI_CC |= 0x00000005;		break;		//	Precision Internal Oscillator
		default:										return;
	}
	
	pSSI->SSI_CPSR |= (ClockPrescalar	<<	0);											//	Step ff.4 of Section 15.4
	
	pSSI->SSI_CR[0] |= ( SerialClkRate	<<	SSI_CR0_SCR);					//	Step ff.5.1 of Section 15.4
	pSSI->SSI_CR[0] |= ( Phase					<<	SSI_CR0_SPH);					//	Step ff.5.2 of Section 15.4
	pSSI->SSI_CR[0] |= ( Polarity				<<	SSI_CR0_SPO);					//	Step ff.5.2 of Section 15.4
	pSSI->SSI_CR[0] |= ( FrameFormat		<<	SSI_CR0_FRF);					//	Step ff.5.3 of Section 15.4
	pSSI->SSI_CR[0] |= ( DataSize				<<	SSI_CR0_DSS);					//	Step ff.5.4 of Section 15.4
	
	/* Step ff.6: DMA Configuration isn't implemented yet. It is optional, so we'll come back to it later, sometime.*/
	
	pSSI->SSI_CR[1] SET_BIT( SSI_CR1_SSE );												//	Step ff.7 of Section 15.4
}




/******************************************************************************************************************
*	@SSIDeInit()																																																		*
*	@brief				-	This function De-Initializes(Reset and Disable) an SSI module.																	*
* @SSIx					-	This is the name of the SSI module which needs to be de-initialized.														*
*																																																									*
*	@Note					- To reset a SSI module, the corresponding bit in the SRSSI register needs to be set. Clock to		*
*									the module is then disabled to save power, and prevent access to the module.										*
******************************************************************************************************************/
void SSIDeInit(uint8_t SSIx)
{
	SYSCTL->SRSSI |=	1<<(SSIx-6);						//	Reset the SSI Module by setting the appropriate bit in the SRSSI register.
	SYSCTL->SRSSI &=	~( 1<<(SSIx-6) );				//	Clear the bit so that the module doesn't always remain in the reset state.
	SSIClockControl(SSIx,DISABLE);						//	Disable clock to the module to save power.
}



/******************************************************************************************************************
* @SPIStart()																																																			*
* @brief											-	This function initializes an SSI module for FREESCALE SPI format with 2MHz Serial	*
*																Clock. Additionally, interrupt delivery from the SSI module to the interrupt			*
*																controller(NVIC) can be enabled or disabled as required.													*
* @SSIx												-	This is the name of the SSI module which needs to be initialized.									*
*	@DeviceMode									-	Used to specify Master or Slave mode.																							*
*	@InterruptsNeedToBeEnabled	- Specifies which interrupts should be enabled.																			*
*																																																									*
* @Note												- SSI configuration for this function:																							*
*																1. Clock Source			-	System Clock(16 MHz in our board)														*
*																2. Clock Prescalar	-	2																														*
*																3. Serial Clk Rate	-	3																														*
*																4. Phase						-	0																														*
*																5. Polarity					-	0																														*
*																6. Frame Format			-	Freescale SPI format																				*
*																7. Data Size				-	16-bit																											*
******************************************************************************************************************/
void SPIStart(uint8_t SSIx,uint8_t DeviceMode, uint8_t InterruptsNeedToBeEnabled)
{
	if(InterruptsNeedToBeEnabled)
	{
		ssi_reg* pSSI = SSIGetAddress(SSIx);
		SSIClockControl(SSIx,ENABLE);
		
		// Enable interrupt reception for the given SSI Module.
		switch(SSIx)
		{
			case	SSI0:			NVIC->EN[0] |= ( 1 << NVIC_EN0_SSI0 );		 	break;
			case	SSI1:			NVIC->EN[1] |= ( 1 << NVIC_EN1_SSI1 );		 	break;
			case	SSI2:			NVIC->EN[1] |= ( 1 << NVIC_EN1_SSI2 );		 	break;	
			case	SSI3:			NVIC->EN[1] |= ( 1 << NVIC_EN1_SSI3 );		 	break;
			default:				return;											//	Break out of the function in case of a mismatch.
		}
		
