ronit991/TivaPeripheralDrivers/TM4C123xxSSI_DRIVER.c
		/**************************************************************************************************************
		*	The Interrupt Mode macros (defined in the SSI driver header file) have integer values equal to their bit		*
		*	position in the Interrupt Mask register (SSIIM) plus 'one'. To enable an interrupt, corresponding mask 			*
		*	should be disabled by setting the bit in SSIIM register. To get the bit position, subtract one from the			*
		*	interrupt mode variable (InterruptsNeedToBeEnabled).																												*
		**************************************************************************************************************/
		if(InterruptsNeedToBeEnabled == SSI_InterruptTxRxBoth)
			pSSI->SSI_IM |= 0x0000000C;
		else
		{
			uint8_t IntrMaskPosition = ( InterruptsNeedToBeEnabled - 1 );
			pSSI->SSI_IM SET_BIT( IntrMaskPosition );													//	Enable the requested interrupt.
		}
	}
	
	//SSIInit(SSIx, DeviceMode, ClockSource, ClockPrescalar, SerialClockRate, Phase, Polarity, FrameFormat, DataSize)
	SSIInit(SSIx, DeviceMode, SSI_Clk_SystemClock, 2, 3, 0, 0, SSI_FreescaleFormat, SSI_Data_16bit);
}



/******************************************************************************************************************
*	@SSISendData()																																																	*
*	@brief				-	This function is used to transmit/send data over an SSI channel.																*
* @SSIx					-	This is the name of the SSI module over which, data has to be sent.															*
*	@DataBuf			-	Pointer to the data that has to be transmitted.																									*
*	@Len					-	Length of Data (in bits) which needs to be sent.																								*
*																																																									*
*	@Note					-	This function does not care if the SSI module is properly initialized or not. Make sure that		*
*									the SSI module is already configured as needed otherwise data transmission might not occur.			*
*									Also, it might generate bus faults if the clock is disabled.																		*
*	@Note2				-	In case of incorrect data length, the function does not proceed further and breaks out.					*
******************************************************************************************************************/
void SSISendData(uint8_t SSIx, uint16_t* DataBuf, uint8_t Len)
{
	ssi_reg* pSSI = SSIGetAddress(SSIx);

	if(Len <= 0)	return;											//	Break out of the function in case of incorrect length.
	else
	{
		uint8_t n = ceil( Len/16.0 );						//	Tx count (no of 16 bit data packets that are to be sent)
		do
		{
			WaitWhileSSIControllerIsBusy(pSSI);
			
			pSSI->SSI_DR = (*DataBuf)<<0;					//	Insert data into the Tx buffer by writing it to SSIDR register.
			
			DataBuf++;														//	Step the pointer to the next data set.
			n--;																	//	Decrease the Tx count.
		}while(n>0);														//	Do this until the Tx count becomes zero.
	}
}
/******************************************************************************************************************
*	@SSISend()																																																			*
*	@brief				-	This function is used to transmit a single packet(16-bit) over an SSI channel.									*
* @SSIx					-	This is the name of the SSI module over which, data has to be sent.															*
*	@Data					-	Data that needs to be transmitted.																															*
*																																																									*
*	@Note					-	This function does not care if the SSI module is properly initialized or not. Make sure that		*
*									the SSI module is already configured as needed otherwise data transmission might not occur.			*
*									Also, it might generate bus faults if the clock is disabled.																		*
******************************************************************************************************************/
void SSISend(uint8_t SSIx, uint16_t Data)
{
	ssi_reg* pSSI = SSIGetAddress(SSIx);

	WaitWhileSSIControllerIsBusy(pSSI);
			
	pSSI->SSI_DR = Data<<0;										//	Insert data into the Tx buffer by writing it to SSIDR register.
}



/******************************************************************************************************************
*	@SSIRecvData()																																																	*
*	@brief				-	This function is used to recevie data over an SSI channel.																			*
* @SSIx					-	This is the name of the SSI module from which, data has to be received.													*
*	@DataBuf			-	Pointer to data buffer which will be used to hold the received data.														*
*	@Len					-	Length of Data (in bits) which needs to be received.																						*
*																																																									*
*	@Note					-	This function does not care if the SSI module is properly initialized or not. Make sure that		*
*									the SSI module is already configured as needed otherwise no data will be received.							*
*									Also, it might generate bus faults if the clock is disabled.																		*
*	@Note2				-	In case of incorrect data length, the function does not proceed further and breaks out.					*
******************************************************************************************************************/
void SSIRecvData(uint8_t SSIx, uint16_t* DataBuf, uint8_t Len)
{
	ssi_reg* pSSI = SSIGetAddress(SSIx);
	
	if(Len <= 0)	return;											//	Break out of the function in case of incorrect data length
	else
	{
		
		uint8_t n = ceil( Len/16.0 );						// Rx count (no of 16 bit data packets that are to be received)
		do
		{
			WaitWhileSSIControllerIsBusy(pSSI);
			
			*DataBuf = (uint16_t)pSSI->SSI_DR;
			/************************************************************************************************************
			*	Pick data from SSIDR register, and put it into the Rx buffer. NOTE: SSI_DR register is 32-bit register,		*
			*	but Rx shift register is of 16-bits. Rest of the 16 bits in the SSI_DR register are reserved. Data, of		*
			*	our concern, lies in the first 16-bits. So we convert the value in the SSI_DR register to uint16_t. This	*
			*	discards the higher 16 bits, and stores the remaining bits in the data variable, pointed by DataBuf.			*
			************************************************************************************************************/
			
			DataBuf++;														//	Step the pointer for the next data set.
			n--;																	//	Decrease the Rx-count.
		}while(n>0);														//	Do this until the Rx-count becomes zero.
	}
}



/******************************************************************************************************************
*	@SSIRecv()																																																			*
*	@brief				-	This function is used to receive a single packet(16-bit) over an SSI channel.										*
* @SSIx					-	This is the name of the SSI module over which, data should be received.													*
*	@DataBuf			-	Pointer to the variable where received data should be stored.																		*
*																																																									*
*	@Note					-	This function does not care if the SSI module is properly initialized or not. Make sure that		*
*									the SSI module is already configured as needed otherwise data might not be received.						*
*									Also, it might generate bus faults if the clock is disabled.																		*
******************************************************************************************************************/
void SSIRecv(uint8_t SSIx, uint16_t* DataBuf)
{
	ssi_reg* pSSI = SSIGetAddress(SSIx);
	WaitWhileSSIControllerIsBusy(pSSI);
	
	*DataBuf = (uint16_t)pSSI->SSI_DR;
	/****************************************************************************************************************
	*	Pick data from SSIDR register, and put it into the Rx buffer. NOTE: SSI_DR register is 32-bit register, but		*
	*	Rx shift register is of 16-bits. Rest 16 bits in the SSI_DR register are reserved. Data, of our concern, lies	*
	*	in the first 16-bits. So we convert the value in the SSI_DR register to uint16_t. This discards the higher		*
	*	16 bits, and stores the remaining bits in the data variable, pointed by DataBuf.															*
	****************************************************************************************************************/
}



/******************************************************************************************************************
* @SSISendWithIntr()																																															*
* @brief				-	This function sends data over an SSI module without blocking the CPU.														*
* @SSIx					-	This is the name of the SSI module over which, data has to be sent.															*
*	@DataBuf			-	Data buffer, which points to the data that has to be transmitted.																*
*	@Len					-	Data Size, or the length of Data bits which need to be sent.																		*
* @return				-	None.																																														*
******************************************************************************************************************/
void SSISendWithIntr(uint8_t SSIx, uint16_t* DataBuf, uint8_t Len)
{
	ssi_reg* pSSI = SSIGetAddress(SSIx);
	
	pSSI->SSI_CR[1] CLR_BIT( SSI_CR1_SSE );						//	Disable SSI operation.
	pSSI->SSI_IM 		SET_BIT( SSI_IM_TX );
	pSSI->SSI_CR[1] SET_BIT( SSI_CR1_SSE );						//	Re-Enable SSI operation.

