ronit991/TivaPeripheralDrivers/TM4C123xxSSI_DRIVER.c
	SSIIntrTxBuf[SSIx-6] = DataBuf;									//	Save the data pointer to the appropriate buffer variable.
	SSIIntrTxCount[SSIx-6] = ceil( Len/16.0 );			//	Tx count (no of 16-bit data packets that are to be sent)
}



/******************************************************************************************************************
* @SSIRecvWithIntr()																																															*
* @brief				-	This function receives data from an SSI module without blocking the CPU.												*
* @SSIx					-	This is the name of the SSI module from which, data has to be received.													*
*	@DataBuf			-	Pointer to data buffer which will be used to hold the received data.														*
*	@Len					-	Length of Data (in bits) which need to be received.																							*
* @return				-	None.																																														*
******************************************************************************************************************/
void SSIRecvWithIntr(uint8_t SSIx, __vo uint16_t *DataBuf, uint8_t Len)
{
	ssi_reg* pSSI = SSIGetAddress(SSIx);
	
	pSSI->SSI_CR[1] CLR_BIT( SSI_CR1_SSE );						//	Disable SSI operation.
	pSSI->SSI_IM 		SET_BIT( SSI_IM_RX );
	pSSI->SSI_CR[1] SET_BIT( SSI_CR1_SSE );						//	Re-Enable SSI operation.
	
	SSIIntrRxBuf[SSIx-6] = DataBuf;									//	Save the data pointer to the appropriate buffer variable.
	SSIIntrRxCount[SSIx-6] = ceil( Len/16.0 );			//	Rx count (no of 16-bit data packets that are to be sent)
}



/******************************************************************************************************************
* @SSIIntrSend()																																																	*
* @brief				-	Function to send data over an SSI Module. It needs to be called from Interrupt Handler.					*
* @SSIx					-	This is the name of the SSI module over which, data needs to be sent.														*
* @return				-	None.																																														*
******************************************************************************************************************/
void SSIIntrSend(uint8_t SSIx)
{
	uint8_t SSI = SSIx - 6;													//	Index of SSI Module
	ssi_reg* pSSI = SSIGetAddress(SSIx);						//	Pointer to the SSI Module
	
	if(SSIIntrTxCount[SSI] > 0)											//	If the transmission is not complete...
	{
			uint16_t currentData = *SSIIntrTxBuf[SSI];	//	Fetch data from the data buffer
			pSSI->SSI_DR = currentData<<0;							//	Insert data into the Tx buffer by writing it to SSIDR register.

			SSIIntrTxBuf[SSI]++;												//	Step the pointer to the next data set.
			SSIIntrTxCount[SSI]--;											//	Decrease the Tx count.
	}
	if( SSIIntrTxCount[SSI] == 0 )
		pSSI->SSI_IM CLR_BIT( SSI_IM_TX );						//	Disable interrupt reception once the transmission is over.
}



/******************************************************************************************************************
* @SSIIntrRecv()																																																	*
* @brief				-	Function to receive data over an SSI Module. It needs to be called from Interrupt Handler.			*
* @SSIx					-	This is the name of the SSI module from which, data has to be received.													*
* @return				-	None.																																														*
******************************************************************************************************************/
void SSIIntrRecv(uint8_t SSIx)
{
	ssi_reg* pSSI = SSIGetAddress(SSIx);						//	Pointer to the SSI Module
	uint8_t SSI = SSIx - 6;													//	Index of SSI Module
	
	if(SSIIntrTxCount[SSI] > 0)											//	If the transmission is not complete...
	{
		*SSIIntrRxBuf[SSI] = (uint16_t)pSSI->SSI_DR;	//	Pick Data from SSIDR Register and store in the Rx Buffer.

		SSIIntrRxBuf[SSI]++;													//	Step the pointer to the next data set.
		SSIIntrRxCount[SSI]--;												//	Decrease the Rx count.
	}
	if(SSIIntrTxCount[SSI] == 0)
		pSSI->SSI_IM CLR_BIT( SSI_IM_RX );						//	Disable interrupt reception once the transmission is over.
}



/******************************************************************************************************************
* @SSIGetAddress()																																																*
* @brief		-	This function returns the address of SSI module.																										*
* @SSIx			-	This is the name of the SSI module whose address is required.																				*
* @return		-	Pointer to an SSI Module's peripheral register.																											*
******************************************************************************************************************/
ssi_reg* SSIGetAddress(uint8_t SSIx)
{
	switch(SSIx)
	{
		case SSI0:	return pSSI0;
		case SSI1:	return pSSI1;
		case SSI2:	return pSSI2;
		case SSI3:	return pSSI3;
		default:		return NULL;
	}
}



/******************************************************************************************************************
*	@WaitWhileSSIControllerIsBusy()																																									*
* @brief				-	This function pauses program execution while the SSI controller is busy in transmission by			*
*									continuously polling the busy bit of the ssi status register in a loop.													*
* @pSSI					-	Wait for this SSI Module.																																				*
*	@return				-	Nothing (void).																																									*
******************************************************************************************************************/
void WaitWhileSSIControllerIsBusy( ssi_reg* pSSI)
{
	uint8_t Busy;
	do
	{
		Busy = GET_BIT( pSSI->SSI_SR, SSI_SR_BSY );			//	Check the busy bit in the status register.
	}while( Busy );																		//	Wait if the bit is '1'.
}
